[
    {
      "id": "nowthen_1",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken bysantinsk kejsare avsattes 695 efter att ha infört en kontroversiell skatt på vin och som senare återvände till tronen 705?",
      "textEn": "Which Byzantine emperor was deposed in 695 after introducing a controversial tax on wine and later returned to the throne in 705?",
      "optionsSv": ["Justinianus II", "Konstantin IV", "Leontios", "Tiberios III"],
      "optionsEn": ["Justinian II", "Constantine IV", "Leontios", "Tiberius III"],
      "correctIndex": 0,
      "funFactSv": "Justinianus II var den enda bysantinska kejsaren som återvände till tronen efter att ha avsatts och fått näsan avskuren.",
      "funFactEn": "Justinian II was the only Byzantine emperor to return to the throne after being deposed and having his nose cut off."
    },
    {
      "id": "nowthen_2",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken mongolisk khan grundade Yuan-dynastin i Kina och antog titeln Shizu?",
      "textEn": "Which Mongol khan founded the Yuan dynasty in China and adopted the title Shizu?",
      "optionsSv": ["Kublai Khan", "Genghis Khan", "Ögedei Khan", "Möngke Khan"],
      "optionsEn": ["Kublai Khan", "Genghis Khan", "Ögedei Khan", "Möngke Khan"],
      "correctIndex": 0,
      "funFactSv": "Kublai Khan var Genghis Khans sonson och regerade över det största sammanhängande imperiet i världshistorien.",
      "funFactEn": "Kublai Khan was Genghis Khan's grandson and ruled over the largest contiguous empire in world history."
    },
    {
      "id": "nowthen_3",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken fredsöverenskommelse 1555 etablerade principen \"cuius regio, eius religio\" i Tysk-romerska riket?",
      "textEn": "Which 1555 peace settlement established the principle \"cuius regio, eius religio\" in the Holy Roman Empire?",
      "optionsSv": ["Augsburgfreden", "Westfaliska freden", "Passaufreden", "Nürnbergfreden"],
      "optionsEn": ["Peace of Augsburg", "Peace of Westphalia", "Peace of Passau", "Peace of Nuremberg"],
      "correctIndex": 0,
      "funFactSv": "Augsburgfreden lät varje furste välja religion för sitt territorium, vilket formellt erkände lutheranismen i riket.",
      "funFactEn": "The Peace of Augsburg allowed each prince to choose the religion for his territory, formally recognizing Lutheranism in the empire."
    },
    {
      "id": "nowthen_4",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken svensk kung avled under mystiska omständigheter i Norge 1718, vilket ledde till att Karl XII:s syster Ulrika Eleonora besteg tronen?",
      "textEn": "Which Swedish king died under mysterious circumstances in Norway in 1718, leading to Charles XII's sister Ulrika Eleonora ascending the throne?",
      "optionsSv": ["Karl XII", "Karl XI", "Gustav III", "Gustav IV Adolf"],
      "optionsEn": ["Charles XII", "Charles XI", "Gustav III", "Gustav IV Adolf"],
      "correctIndex": 0,
      "funFactSv": "Karl XII sköts till döds vid belägringen av Fredriksten, och det finns teorier om att han dödades av sina egna män.",
      "funFactEn": "Charles XII was shot dead at the siege of Fredriksten, and there are theories that he was killed by his own men."
    },
    {
      "id": "nowthen_5",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken persisk shah av Safavid-dynastin förlorade Tabriz till osmanerna 1514 i slaget vid Chaldiran?",
      "textEn": "Which Persian shah of the Safavid dynasty lost Tabriz to the Ottomans in 1514 at the Battle of Chaldiran?",
      "optionsSv": ["Ismail I", "Tahmasp I", "Abbas I", "Suleiman I"],
      "optionsEn": ["Ismail I", "Tahmasp I", "Abbas I", "Suleiman I"],
      "correctIndex": 0,
      "funFactSv": "Slaget vid Chaldiran markerade början på den långvariga konflikten mellan Safavid-imperiet och Osmanska riket.",
      "funFactEn": "The Battle of Chaldiran marked the beginning of the long-standing conflict between the Safavid Empire and the Ottoman Empire."
    },
    {
      "id": "nowthen_6",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken fransk revolutionär ledde jakobinerna under skräckväldet och avrättades 1794?",
      "textEn": "Which French revolutionary led the Jacobins during the Reign of Terror and was executed in 1794?",
      "optionsSv": ["Maximilien Robespierre", "Georges Danton", "Jean-Paul Marat", "Louis Antoine de Saint-Just"],
      "optionsEn": ["Maximilien Robespierre", "Georges Danton", "Jean-Paul Marat", "Louis Antoine de Saint-Just"],
      "correctIndex": 0,
      "funFactSv": "Robespierre kallas ofta \"den oantastlige\" och var känd för sin obevekliga hållning under revolutionen.",
      "funFactEn": "Robespierre is often called \"the Incorruptible\" and was known for his uncompromising stance during the revolution."
    },
    {
      "id": "nowthen_7",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken bysantinsk general återerövrade Italien från ostrogoterna på 500-talet men dog innan han kunde konsolidera erövringarna?",
      "textEn": "Which Byzantine general reconquered Italy from the Ostrogoths in the 6th century but died before he could consolidate the conquests?",
      "optionsSv": ["Belisarius", "Narses", "Justinianus I", "Heraclius"],
      "optionsEn": ["Belisarius", "Narses", "Justinian I", "Heraclius"],
      "correctIndex": 0,
      "funFactSv": "Belisarius var en av historiens största generaler och återerövrade stora delar av det forna Västromerska riket.",
      "funFactEn": "Belisarius was one of history's greatest generals and reconquered large parts of the former Western Roman Empire."
    },
    {
      "id": "nowthen_8",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken kinesisk kejsare av Ming-dynastin byggde Den förbjudna staden i Peking och skickade Zheng He på sina expeditioner?",
      "textEn": "Which Chinese emperor of the Ming dynasty built the Forbidden City in Beijing and sent Zheng He on his expeditions?",
      "optionsSv": ["Yongle", "Hongwu", "Xuande", "Jiajing"],
      "optionsEn": ["Yongle", "Hongwu", "Xuande", "Jiajing"],
      "correctIndex": 0,
      "funFactSv": "Yongle-kejsaren flyttade huvudstaden från Nanjing till Peking och lät bygga Den förbjudna staden.",
      "funFactEn": "The Yongle Emperor moved the capital from Nanjing to Beijing and had the Forbidden City built."
    },
    {
      "id": "nowthen_9",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken engelsk kung förlorade sina franska besittningar utom Calais efter hundraårskriget och led av psykisk sjukdom?",
      "textEn": "Which English king lost his French possessions except Calais after the Hundred Years' War and suffered from mental illness?",
      "optionsSv": ["Henrik VI", "Henrik V", "Rikard III", "Eduard IV"],
      "optionsEn": ["Henry VI", "Henry V", "Richard III", "Edward IV"],
      "correctIndex": 0,
      "funFactSv": "Henrik VI:s psykiska kollaps och svaga regering ledde till Rosornas krig mellan husen Lancaster och York.",
      "funFactEn": "Henry VI's mental collapse and weak rule led to the Wars of the Roses between the houses of Lancaster and York."
    },
    {
      "id": "nowthen_10",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken rysk tsar avsattes 1762 av sin fru, som senare blev känd som Katarina den stora?",
      "textEn": "Which Russian tsar was deposed in 1762 by his wife, who later became known as Catherine the Great?",
      "optionsSv": ["Peter III", "Peter II", "Ivan VI", "Paul I"],
      "optionsEn": ["Peter III", "Peter II", "Ivan VI", "Paul I"],
      "correctIndex": 0,
      "funFactSv": "Peter III regerade endast sex månader innan han avsattes och mördades, troligen med Katarinas vetskap.",
      "funFactEn": "Peter III ruled for only six months before being deposed and murdered, likely with Catherine's knowledge."
    },
    {
      "id": "nowthen_11",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken spansk conquistador erövrade Inkariket och avrättade Atahualpa 1533?",
      "textEn": "Which Spanish conquistador conquered the Inca Empire and executed Atahualpa in 1533?",
      "optionsSv": ["Francisco Pizarro", "Hernán Cortés", "Diego de Almagro", "Pedro de Valdivia"],
      "optionsEn": ["Francisco Pizarro", "Hernán Cortés", "Diego de Almagro", "Pedro de Valdivia"],
      "correctIndex": 0,
      "funFactSv": "Pizarro erövrade Inkariket med bara 168 man tack vare överraskning, teknologi och inbördeskrig bland inkorna.",
      "funFactEn": "Pizarro conquered the Inca Empire with only 168 men thanks to surprise, technology, and civil war among the Incas."
    },
    {
      "id": "nowthen_12",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken ottomansk sultan erövrade Konstantinopel 1453 och avslutade därmed Bysantinska riket?",
      "textEn": "Which Ottoman sultan conquered Constantinople in 1453, thus ending the Byzantine Empire?",
      "optionsSv": ["Mehmed II", "Murad II", "Bayezid I", "Selim I"],
      "optionsEn": ["Mehmed II", "Murad II", "Bayezid I", "Selim I"],
      "correctIndex": 0,
      "funFactSv": "Mehmed II kallas \"Erövraren\" och hans intagande av Konstantinopel markerade slutet på medeltiden.",
      "funFactEn": "Mehmed II is called \"the Conqueror\" and his capture of Constantinople marked the end of the Middle Ages."
    },
    {
      "id": "nowthen_13",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken tysk kejsare avsattes 1806 av Napoleon, vilket formellt avslutade Tysk-romerska riket?",
      "textEn": "Which German emperor was deposed in 1806 by Napoleon, formally ending the Holy Roman Empire?",
      "optionsSv": ["Franz II", "Leopold II", "Josef II", "Karl VI"],
      "optionsEn": ["Francis II", "Leopold II", "Joseph II", "Charles VI"],
      "correctIndex": 0,
      "funFactSv": "Franz II abdikerade som tysk-romersk kejsare men behöll titeln som österrikisk kejsare.",
      "funFactEn": "Francis II abdicated as Holy Roman Emperor but retained the title of Austrian Emperor."
    },
    {
      "id": "nowthen_14",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken japansk shogun etablerade Tokugawa-shogunatet 1603 efter slaget vid Sekigahara?",
      "textEn": "Which Japanese shogun established the Tokugawa shogunate in 1603 after the Battle of Sekigahara?",
      "optionsSv": ["Tokugawa Ieyasu", "Toyotomi Hideyoshi", "Oda Nobunaga", "Tokugawa Hidetada"],
      "optionsEn": ["Tokugawa Ieyasu", "Toyotomi Hideyoshi", "Oda Nobunaga", "Tokugawa Hidetada"],
      "correctIndex": 0,
      "funFactSv": "Ieyasu grundade en dynasti som skulle regera Japan i över 250 år och inledde en period av isolering.",
      "funFactEn": "Ieyasu founded a dynasty that would rule Japan for over 250 years and began a period of isolation."
    },
    {
      "id": "nowthen_15",
      "category": "nowThen",
      "difficulty": "hard",
      "textSv": "Vilken fransk kung kallas \"Solkungen\" och centraliserade makten i Frankrike under 1600-talet?",
      "textEn": "Which French king is called \"the Sun King\" and centralized power in France during the 17th century?",
      "optionsSv": ["Ludvig XIV", "Ludvig XIII", "Henrik IV", "Ludvig XV"],
      "optionsEn": ["Louis XIV", "Louis XIII", "Henry IV", "Louis XV"],
      "correctIndex": 0,
      "funFactSv": "Ludvig XIV regerade i 72 år, längre än någon annan europeisk monark, och byggde Versailles.",
      "funFactEn": "Louis XIV ruled for 72 years, longer than any other European monarch, and built Versailles."
    },
    {
      "id": "ent_1",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken rysk författare skrev \"Broderskap\" och \"Den döde huset\" och tillbringade fyra år i sibirisk straffkoloni?",
      "textEn": "Which Russian author wrote \"The House of the Dead\" and \"The Brothers Karamazov\" and spent four years in a Siberian penal colony?",
      "optionsSv": ["Fjodor Dostojevskij", "Leo Tolstoj", "Nikolaj Gogol", "Ivan Turgenjev"],
      "optionsEn": ["Fyodor Dostoevsky", "Leo Tolstoy", "Nikolai Gogol", "Ivan Turgenev"],
      "correctIndex": 0,
      "funFactSv": "Dostojevskij dömdes till döden för politisk verksamhet men benådades i sista stund och skickades till Sibirien.",
      "funFactEn": "Dostoevsky was sentenced to death for political activity but was pardoned at the last moment and sent to Siberia."
    },
    {
      "id": "ent_2",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken tjeckisk författare skrev \"Processen\" och \"Slottet\" och dog i tuberkulos 1924?",
      "textEn": "Which Czech author wrote \"The Trial\" and \"The Castle\" and died of tuberculosis in 1924?",
      "optionsSv": ["Franz Kafka", "Milan Kundera", "Karel Čapek", "Bohumil Hrabal"],
      "optionsEn": ["Franz Kafka", "Milan Kundera", "Karel Čapek", "Bohumil Hrabal"],
      "correctIndex": 0,
      "funFactSv": "Kafka bad sin vän Max Brod att förstöra alla hans verk efter hans död, men Brod publicerade dem istället.",
      "funFactEn": "Kafka asked his friend Max Brod to destroy all his works after his death, but Brod published them instead."
    },
    {
      "id": "ent_3",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken irisk författare skrev \"Ulysses\" och revolutionerade den modernistiska romanen med sin ström av medvetande-teknik?",
      "textEn": "Which Irish author wrote \"Ulysses\" and revolutionized the modernist novel with his stream of consciousness technique?",
      "optionsSv": ["James Joyce", "Samuel Beckett", "Oscar Wilde", "W.B. Yeats"],
      "optionsEn": ["James Joyce", "Samuel Beckett", "Oscar Wilde", "W.B. Yeats"],
      "correctIndex": 0,
      "funFactSv": "Ulysses var förbjuden i USA och Storbritannien i många år på grund av sina sexuella och religiösa referenser.",
      "funFactEn": "Ulysses was banned in the US and UK for many years due to its sexual and religious references."
    },
    {
      "id": "ent_4",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken fransk författare skrev \"På spaning efter den tid som flytt\" och skildrade minnet som ett centralt tema?",
      "textEn": "Which French author wrote \"In Search of Lost Time\" and made memory a central theme?",
      "optionsSv": ["Marcel Proust", "Albert Camus", "Jean-Paul Sartre", "Gustave Flaubert"],
      "optionsEn": ["Marcel Proust", "Albert Camus", "Jean-Paul Sartre", "Gustave Flaubert"],
      "correctIndex": 0,
      "funFactSv": "Prousts verk är över 3 000 sidor långt och anses vara en av litteraturhistoriens största prestationer.",
      "funFactEn": "Proust's work is over 3,000 pages long and is considered one of literature's greatest achievements."
    },
    {
      "id": "ent_5",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken tysk kompositör skrev \"Wozzeck\" och \"Lulu\" och utvecklade tolvtonstekniken?",
      "textEn": "Which German composer wrote \"Wozzeck\" and \"Lulu\" and developed the twelve-tone technique?",
      "optionsSv": ["Alban Berg", "Arnold Schönberg", "Anton Webern", "Richard Strauss"],
      "optionsEn": ["Alban Berg", "Arnold Schoenberg", "Anton Webern", "Richard Strauss"],
      "correctIndex": 0,
      "funFactSv": "Berg var elev till Schönberg och kombinerade tolvtonsteknik med romantiska element i sina operor.",
      "funFactEn": "Berg was a student of Schoenberg and combined twelve-tone technique with romantic elements in his operas."
    },
    {
      "id": "ent_6",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken rysk kompositör skrev \"Rite of Spring\" som orsakade upplopp vid premiären 1913 i Paris?",
      "textEn": "Which Russian composer wrote \"The Rite of Spring\" which caused riots at its premiere in Paris in 1913?",
      "optionsSv": ["Igor Stravinsky", "Sergej Prokofjev", "Dmitrij Sjostakovitj", "Modest Musorgskij"],
      "optionsEn": ["Igor Stravinsky", "Sergei Prokofiev", "Dmitri Shostakovich", "Modest Mussorgsky"],
      "correctIndex": 0,
      "funFactSv": "Rite of Spring revolutionerade balettmusiken med sin komplexa rytmik och dissonanta harmonier.",
      "funFactEn": "The Rite of Spring revolutionized ballet music with its complex rhythms and dissonant harmonies."
    },
    {
      "id": "ent_7",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken tysk filosof skrev \"Sein und Zeit\" och introducerade begreppet Dasein i existentiell filosofi?",
      "textEn": "Which German philosopher wrote \"Being and Time\" and introduced the concept of Dasein in existential philosophy?",
      "optionsSv": ["Martin Heidegger", "Edmund Husserl", "Karl Jaspers", "Hannah Arendt"],
      "optionsEn": ["Martin Heidegger", "Edmund Husserl", "Karl Jaspers", "Hannah Arendt"],
      "correctIndex": 0,
      "funFactSv": "Heideggers filosofi har haft enorm påverkan på kontinental filosofi och postmodernism trots kontroverser kring hans nazistiska sympatier.",
      "funFactEn": "Heidegger's philosophy has had enormous influence on continental philosophy and postmodernism despite controversies over his Nazi sympathies."
    },
    {
      "id": "ent_8",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken fransk filosof skrev \"Disciplin och straff\" och analyserade maktens mekanismer i samhället?",
      "textEn": "Which French philosopher wrote \"Discipline and Punish\" and analyzed mechanisms of power in society?",
      "optionsSv": ["Michel Foucault", "Jean-Paul Sartre", "Jacques Derrida", "Gilles Deleuze"],
      "optionsEn": ["Michel Foucault", "Jean-Paul Sartre", "Jacques Derrida", "Gilles Deleuze"],
      "correctIndex": 0,
      "funFactSv": "Foucault introducerade begreppet panoptikon och analyserade hur makt utövas genom kunskap och diskurs.",
      "funFactEn": "Foucault introduced the concept of the panopticon and analyzed how power is exercised through knowledge and discourse."
    },
    {
      "id": "ent_9",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken svensk regissör skapade \"Fanny och Alexander\" och \"Viskningar och rop\" och är känd för sin psykologiska djup?",
      "textEn": "Which Swedish director created \"Fanny and Alexander\" and \"Cries and Whispers\" and is known for his psychological depth?",
      "optionsSv": ["Ingmar Bergman", "Lukas Moodysson", "Ruben Östlund", "Roy Andersson"],
      "optionsEn": ["Ingmar Bergman", "Lukas Moodysson", "Ruben Östlund", "Roy Andersson"],
      "correctIndex": 0,
      "funFactSv": "Bergman regisserade över 60 filmer och är en av filmhistoriens mest inflytelserika regissörer.",
      "funFactEn": "Bergman directed over 60 films and is one of cinema's most influential directors."
    },
    {
      "id": "ent_10",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken japansk regissör skapade \"Sju samurajer\" och \"Rashomon\" och introducerade japansk film för västvärlden?",
      "textEn": "Which Japanese director created \"Seven Samurai\" and \"Rashomon\" and introduced Japanese cinema to the Western world?",
      "optionsSv": ["Akira Kurosawa", "Yasujirō Ozu", "Kenji Mizoguchi", "Hiroshi Inagaki"],
      "optionsEn": ["Akira Kurosawa", "Yasujirō Ozu", "Kenji Mizoguchi", "Hiroshi Inagaki"],
      "correctIndex": 0,
      "funFactSv": "Kurosawas Rashomon vann Guldlejonet i Venedig 1951 och revolutionerade berättandet med flera perspektiv.",
      "funFactEn": "Kurosawa's Rashomon won the Golden Lion in Venice in 1951 and revolutionized storytelling with multiple perspectives."
    },
    {
      "id": "ent_11",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken amerikansk författare skrev \"Lolita\" och \"Pale Fire\" och är känd för sin komplexa språkbehandling?",
      "textEn": "Which American author wrote \"Lolita\" and \"Pale Fire\" and is known for his complex language handling?",
      "optionsSv": ["Vladimir Nabokov", "Thomas Pynchon", "Don DeLillo", "David Foster Wallace"],
      "optionsEn": ["Vladimir Nabokov", "Thomas Pynchon", "Don DeLillo", "David Foster Wallace"],
      "correctIndex": 0,
      "funFactSv": "Nabokov skrev på ryska, engelska och franska och var också en expert på fjärilar.",
      "funFactEn": "Nabokov wrote in Russian, English, and French and was also an expert on butterflies."
    },
    {
      "id": "ent_12",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken argentinsk författare skrev \"Fiktioner\" och \"Aleph\" och skapade komplexa labyrinter av verklighet och fantasi?",
      "textEn": "Which Argentine author wrote \"Fictions\" and \"The Aleph\" and created complex labyrinths of reality and fantasy?",
      "optionsSv": ["Jorge Luis Borges", "Julio Cortázar", "Ernesto Sabato", "Adolfo Bioy Casares"],
      "optionsEn": ["Jorge Luis Borges", "Julio Cortázar", "Ernesto Sabato", "Adolfo Bioy Casares"],
      "correctIndex": 0,
      "funFactSv": "Borges blev blind i vuxen ålder men fortsatte att diktera sina verk och blev bibliotekarie.",
      "funFactEn": "Borges became blind in adulthood but continued to dictate his works and became a librarian."
    },
    {
      "id": "ent_13",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken tysk kompositör skrev \"Musikalisches Opfer\" och \"Kunst der Fuge\" och är känd som barockens mästare?",
      "textEn": "Which German composer wrote \"The Musical Offering\" and \"The Art of Fugue\" and is known as the master of the Baroque?",
      "optionsSv": ["Johann Sebastian Bach", "Georg Friedrich Händel", "Antonio Vivaldi", "Henry Purcell"],
      "optionsEn": ["Johann Sebastian Bach", "George Frideric Handel", "Antonio Vivaldi", "Henry Purcell"],
      "correctIndex": 0,
      "funFactSv": "Bach skrev över 1 000 verk och hans teknik inom kontrapunkt och fuga är oöverträffad.",
      "funFactEn": "Bach wrote over 1,000 works and his technique in counterpoint and fugue is unsurpassed."
    },
    {
      "id": "ent_14",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken österrikisk kompositör skrev \"Wozzeck\" och \"Lulu\" och var elev till Arnold Schönberg?",
      "textEn": "Which Austrian composer wrote \"Wozzeck\" and \"Lulu\" and was a student of Arnold Schoenberg?",
      "optionsSv": ["Alban Berg", "Anton Webern", "Gustav Mahler", "Arnold Schönberg"],
      "optionsEn": ["Alban Berg", "Anton Webern", "Gustav Mahler", "Arnold Schoenberg"],
      "correctIndex": 0,
      "funFactSv": "Berg dog innan han hann fullborda Lulu, och operan kompletterades först 1979 av Friedrich Cerha.",
      "funFactEn": "Berg died before completing Lulu, and the opera was only completed in 1979 by Friedrich Cerha."
    },
    {
      "id": "ent_15",
      "category": "entertainment",
      "difficulty": "hard",
      "textSv": "Vilken fransk filosof skrev \"Det andra könet\" och grundade modern feministisk teori?",
      "textEn": "Which French philosopher wrote \"The Second Sex\" and founded modern feminist theory?",
      "optionsSv": ["Simone de Beauvoir", "Simone Weil", "Hélène Cixous", "Julia Kristeva"],
      "optionsEn": ["Simone de Beauvoir", "Simone Weil", "Hélène Cixous", "Julia Kristeva"],
      "correctIndex": 0,
      "funFactSv": "De Beauvoirs verk från 1949 analyserar kvinnans situation och introducerade begreppet \"den andra\".",
      "funFactEn": "De Beauvoir's 1949 work analyzes women's situation and introduced the concept of \"the Other\"."
    },
    {
      "id": "nearf_1",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Centralasien har huvudstaden Bishkek och var en del av Sovjetunionen fram till 1991?",
      "textEn": "Which Central Asian country has the capital Bishkek and was part of the Soviet Union until 1991?",
      "optionsSv": ["Kirgizistan", "Tadzjikistan", "Turkmenistan", "Uzbekistan"],
      "optionsEn": ["Kyrgyzstan", "Tajikistan", "Turkmenistan", "Uzbekistan"],
      "correctIndex": 0,
      "funFactSv": "Kirgizistan är ett bergigt land där över 90 procent av landet ligger över 1 500 meter.",
      "funFactEn": "Kyrgyzstan is a mountainous country where over 90 percent of the land is above 1,500 meters."
    },
    {
      "id": "nearf_2",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilken stad i Etiopien ligger på 2 400 meters höjd och är en av världens högst belägna huvudstäder?",
      "textEn": "Which city in Ethiopia lies at 2,400 meters altitude and is one of the world's highest capitals?",
      "optionsSv": ["Addis Abeba", "Nairobi", "La Paz", "Quito"],
      "optionsEn": ["Addis Ababa", "Nairobi", "La Paz", "Quito"],
      "correctIndex": 0,
      "funFactSv": "Addis Abeba betyder \"ny blomma\" på amhariska och är säte för Afrikanska unionen.",
      "funFactEn": "Addis Ababa means \"new flower\" in Amharic and is the seat of the African Union."
    },
    {
      "id": "nearf_3",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Västafrika har huvudstaden Ouagadougou och var tidigare känt som Övre Volta?",
      "textEn": "Which West African country has the capital Ouagadougou and was formerly known as Upper Volta?",
      "optionsSv": ["Burkina Faso", "Mali", "Niger", "Togo"],
      "optionsEn": ["Burkina Faso", "Mali", "Niger", "Togo"],
      "correctIndex": 0,
      "funFactSv": "Burkina Faso betyder \"landet av de ärliga människorna\" och bytte namn från Övre Volta 1984.",
      "funFactEn": "Burkina Faso means \"land of the honest people\" and changed its name from Upper Volta in 1984."
    },
    {
      "id": "nearf_4",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Sydostasien består av två huvudöar, Luzon och Mindanao, och har över 7 000 öar totalt?",
      "textEn": "Which Southeast Asian country consists of two main islands, Luzon and Mindanao, and has over 7,000 islands total?",
      "optionsSv": ["Filippinerna", "Indonesien", "Malaysia", "Thailand"],
      "optionsEn": ["Philippines", "Indonesia", "Malaysia", "Thailand"],
      "correctIndex": 0,
      "funFactSv": "Filippinerna är världens femte största ö-nation och har över 100 miljoner invånare.",
      "funFactEn": "The Philippines is the world's fifth-largest archipelagic nation with over 100 million inhabitants."
    },
    {
      "id": "nearf_5",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Sydamerika har tre huvudstäder: Sucre (konstitutionell), La Paz (regeringssäte) och Cochabamba?",
      "textEn": "Which South American country has three capitals: Sucre (constitutional), La Paz (government seat) and Cochabamba?",
      "optionsSv": ["Bolivia", "Paraguay", "Ecuador", "Uruguay"],
      "optionsEn": ["Bolivia", "Paraguay", "Ecuador", "Uruguay"],
      "correctIndex": 0,
      "funFactSv": "Bolivia är ett av världens enda länder utan kustlinje tillsammans med Paraguay.",
      "funFactEn": "Bolivia is one of the world's only landlocked countries along with Paraguay."
    },
    {
      "id": "nearf_6",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilken stad i Marocko är känd för sin blå färgade medina och ligger i Rifbergen?",
      "textEn": "Which city in Morocco is famous for its blue-painted medina and is located in the Rif Mountains?",
      "optionsSv": ["Chefchaouen", "Marrakech", "Fes", "Casablanca"],
      "optionsEn": ["Chefchaouen", "Marrakech", "Fes", "Casablanca"],
      "correctIndex": 0,
      "funFactSv": "Chefchaouens blå färg sägs ha introducerats av judiska flyktingar på 1930-talet.",
      "funFactEn": "Chefchaouen's blue color is said to have been introduced by Jewish refugees in the 1930s."
    },
    {
      "id": "nearf_7",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Östafrika har huvudstaden Dodoma men har Dar es Salaam som största stad och kommersiella centrum?",
      "textEn": "Which East African country has the capital Dodoma but has Dar es Salaam as its largest city and commercial center?",
      "optionsSv": ["Tanzania", "Kenya", "Uganda", "Rwanda"],
      "optionsEn": ["Tanzania", "Kenya", "Uganda", "Rwanda"],
      "correctIndex": 0,
      "funFactSv": "Tanzania bildades 1964 genom sammanslagning av Tanganyika och Zanzibar.",
      "funFactEn": "Tanzania was formed in 1964 through the merger of Tanganyika and Zanzibar."
    },
    {
      "id": "nearf_8",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Kaukasus har huvudstaden Jerevan och var det första landet som antog kristendomen som statsreligion?",
      "textEn": "Which country in the Caucasus has the capital Yerevan and was the first country to adopt Christianity as the state religion?",
      "optionsSv": ["Armenien", "Georgien", "Azerbajdzjan", "Turkiet"],
      "optionsEn": ["Armenia", "Georgia", "Azerbaijan", "Turkey"],
      "correctIndex": 0,
      "funFactSv": "Armenien antog kristendomen år 301, flera decennier före Romarriket.",
      "funFactEn": "Armenia adopted Christianity in 301, several decades before the Roman Empire."
    },
    {
      "id": "nearf_9",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Västafrika var tidigare känt som Dahomey och är känt för sina historiska amazonsoldater?",
      "textEn": "Which West African country was formerly known as Dahomey and is famous for its historical Amazon warriors?",
      "optionsSv": ["Benin", "Togo", "Ghana", "Nigeria"],
      "optionsEn": ["Benin", "Togo", "Ghana", "Nigeria"],
      "correctIndex": 0,
      "funFactSv": "Kungariket Dahomey hade en elitkår av kvinnliga soldater som var fruktade i hela regionen.",
      "funFactEn": "The Kingdom of Dahomey had an elite corps of female soldiers who were feared throughout the region."
    },
    {
      "id": "nearf_10",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Sydasien har huvudstaden Thimphu och mäter lycka med bruttonationallycka (GNH) istället för BNP?",
      "textEn": "Which South Asian country has the capital Thimphu and measures happiness with Gross National Happiness (GNH) instead of GDP?",
      "optionsSv": ["Bhutan", "Nepal", "Bangladesh", "Sri Lanka"],
      "optionsEn": ["Bhutan", "Nepal", "Bangladesh", "Sri Lanka"],
      "correctIndex": 0,
      "funFactSv": "Bhutan var länge isolerat från omvärlden och tillät turism först 1974.",
      "funFactEn": "Bhutan was long isolated from the outside world and only allowed tourism in 1974."
    },
    {
      "id": "nearf_11",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Oceanien består av över 300 öar och har huvudstaden Suva?",
      "textEn": "Which country in Oceania consists of over 300 islands and has the capital Suva?",
      "optionsSv": ["Fiji", "Vanuatu", "Samoa", "Tonga"],
      "optionsEn": ["Fiji", "Vanuatu", "Samoa", "Tonga"],
      "correctIndex": 0,
      "funFactSv": "Fiji blev självständigt från Storbritannien 1970 och har en stor indisk befolkning.",
      "funFactEn": "Fiji gained independence from Britain in 1970 and has a large Indian population."
    },
    {
      "id": "nearf_12",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Centralasien har huvudstaden Dushanbe och är det minsta landet i regionen?",
      "textEn": "Which Central Asian country has the capital Dushanbe and is the smallest country in the region?",
      "optionsSv": ["Tadzjikistan", "Kirgizistan", "Turkmenistan", "Uzbekistan"],
      "optionsEn": ["Tajikistan", "Kyrgyzstan", "Turkmenistan", "Uzbekistan"],
      "correctIndex": 0,
      "funFactSv": "Tadzjikistan är bergigt med över 90 procent av landet över 1 000 meter och har rika vattenresurser.",
      "funFactEn": "Tajikistan is mountainous with over 90 percent of the country above 1,000 meters and has rich water resources."
    },
    {
      "id": "nearf_13",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Västafrika har huvudstaden Banjul och är det minsta landet på det afrikanska fastlandet?",
      "textEn": "Which West African country has the capital Banjul and is the smallest country on the African mainland?",
      "optionsSv": ["Gambia", "Guinea-Bissau", "Sierra Leone", "Liberia"],
      "optionsEn": ["Gambia", "Guinea-Bissau", "Sierra Leone", "Liberia"],
      "correctIndex": 0,
      "funFactSv": "Gambia är nästan helt omgivet av Senegal och följer Gambiafloden.",
      "funFactEn": "Gambia is almost entirely surrounded by Senegal and follows the Gambia River."
    },
    {
      "id": "nearf_14",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Karibien har huvudstaden Port-au-Prince och var världens första svarta republik?",
      "textEn": "Which Caribbean country has the capital Port-au-Prince and was the world's first black republic?",
      "optionsSv": ["Haiti", "Dominikanska republiken", "Jamaica", "Trinidad och Tobago"],
      "optionsEn": ["Haiti", "Dominican Republic", "Jamaica", "Trinidad and Tobago"],
      "correctIndex": 0,
      "funFactSv": "Haiti blev självständigt 1804 efter en slavrevolt ledd av Toussaint Louverture.",
      "funFactEn": "Haiti gained independence in 1804 after a slave revolt led by Toussaint Louverture."
    },
    {
      "id": "nearf_15",
      "category": "nearFar",
      "difficulty": "hard",
      "textSv": "Vilket land i Sydostasien har huvudstaden Vientiane och är det enda landet i regionen utan kustlinje?",
      "textEn": "Which Southeast Asian country has the capital Vientiane and is the only landlocked country in the region?",
      "optionsSv": ["Laos", "Kambodja", "Myanmar", "Thailand"],
      "optionsEn": ["Laos", "Cambodia", "Myanmar", "Thailand"],
      "correctIndex": 0,
      "funFactSv": "Laos är ett av världens minst utvecklade länder och har en unik buddhistisk kultur.",
      "funFactEn": "Laos is one of the world's least developed countries and has a unique Buddhist culture."
    },
    {
      "id": "sport_1",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken tennisspelare har vunnit flest Grand Slam-titlar i singel bland kvinnor?",
      "textEn": "Which tennis player has won the most Grand Slam singles titles among women?",
      "optionsSv": ["Margaret Court", "Serena Williams", "Steffi Graf", "Martina Navratilova"],
      "optionsEn": ["Margaret Court", "Serena Williams", "Steffi Graf", "Martina Navratilova"],
      "correctIndex": 0,
      "funFactSv": "Margaret Court vann 24 Grand Slam-titlar i singel, fler än någon annan kvinnlig spelare.",
      "funFactEn": "Margaret Court won 24 Grand Slam singles titles, more than any other female player."
    },
    {
      "id": "sport_2",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken schackspelare höll världsmästartiteln längst tid, från 1894 till 1921?",
      "textEn": "Which chess player held the world championship title the longest, from 1894 to 1921?",
      "optionsSv": ["Emanuel Lasker", "Wilhelm Steinitz", "José Capablanca", "Alexander Alekhine"],
      "optionsEn": ["Emanuel Lasker", "Wilhelm Steinitz", "José Capablanca", "Alexander Alekhine"],
      "correctIndex": 0,
      "funFactSv": "Lasker var världsmästare i 27 år, längre än någon annan schackspelare i historien.",
      "funFactEn": "Lasker was world champion for 27 years, longer than any other chess player in history."
    },
    {
      "id": "sport_3",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilket år arrangerades de första moderna olympiska spelen i Aten?",
      "textEn": "In which year were the first modern Olympic Games held in Athens?",
      "optionsSv": ["1896", "1900", "1904", "1908"],
      "optionsEn": ["1896", "1900", "1904", "1908"],
      "correctIndex": 0,
      "funFactSv": "De moderna olympiska spelen återupplivades av Pierre de Coubertin och hölls i Aten 1896.",
      "funFactEn": "The modern Olympic Games were revived by Pierre de Coubertin and held in Athens in 1896."
    },
    {
      "id": "sport_4",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken svensk orienterare har vunnit flest individuella VM-guld i orientering?",
      "textEn": "Which Swedish orienteer has won the most individual World Championship gold medals in orienteering?",
      "optionsSv": ["Thierry Gueorgiou", "Simone Niggli", "Daniel Hubmann", "Tove Alexandersson"],
      "optionsEn": ["Thierry Gueorgiou", "Simone Niggli", "Daniel Hubmann", "Tove Alexandersson"],
      "correctIndex": 0,
      "funFactSv": "Gueorgiou, som tävlade för Frankrike men är född i Sverige, dominerade orienteringsvärlden på 2000-talet.",
      "funFactEn": "Gueorgiou, who competed for France but was born in Sweden, dominated the orienteering world in the 2000s."
    },
    {
      "id": "sport_5",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken schackspelare var den första att vinna världsmästerskapet i schack tre gånger i rad?",
      "textEn": "Which chess player was the first to win the World Chess Championship three times in a row?",
      "optionsSv": ["Wilhelm Steinitz", "Emanuel Lasker", "José Capablanca", "Alexander Alekhine"],
      "optionsEn": ["Wilhelm Steinitz", "Emanuel Lasker", "José Capablanca", "Alexander Alekhine"],
      "correctIndex": 0,
      "funFactSv": "Steinitz var den första officiella världsmästaren i schack och höll titeln från 1886 till 1894.",
      "funFactEn": "Steinitz was the first official world chess champion and held the title from 1886 to 1894."
    },
    {
      "id": "sport_6",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilket år arrangerades de första paralympiska spelen i Rom?",
      "textEn": "In which year were the first Paralympic Games held in Rome?",
      "optionsSv": ["1960", "1948", "1952", "1964"],
      "optionsEn": ["1960", "1948", "1952", "1964"],
      "correctIndex": 0,
      "funFactSv": "Paralympiska spelen växte fram ur Stoke Mandeville Games, som startades för krigsveteraner 1948.",
      "funFactEn": "The Paralympic Games grew out of the Stoke Mandeville Games, started for war veterans in 1948."
    },
    {
      "id": "sport_7",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken schackspelare var den första att nå en ELO-rating över 2800?",
      "textEn": "Which chess player was the first to reach an ELO rating over 2800?",
      "optionsSv": ["Garry Kasparov", "Bobby Fischer", "Anatoly Karpov", "Vladimir Kramnik"],
      "optionsEn": ["Garry Kasparov", "Bobby Fischer", "Anatoly Karpov", "Vladimir Kramnik"],
      "correctIndex": 0,
      "funFactSv": "Kasparov var världsmästare i 15 år och höll högsta ELO-ratingen i 255 månader i rad.",
      "funFactEn": "Kasparov was world champion for 15 years and held the highest ELO rating for 255 consecutive months."
    },
    {
      "id": "sport_8",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken tennisspelare har vunnit flest Grand Slam-titlar i singel bland män?",
      "textEn": "Which tennis player has won the most Grand Slam singles titles among men?",
      "optionsSv": ["Novak Djokovic", "Roger Federer", "Rafael Nadal", "Pete Sampras"],
      "optionsEn": ["Novak Djokovic", "Roger Federer", "Rafael Nadal", "Pete Sampras"],
      "correctIndex": 0,
      "funFactSv": "Djokovic har vunnit alla fyra Grand Slam-turneringar minst tre gånger vardera, en unik bedrift.",
      "funFactEn": "Djokovic has won all four Grand Slam tournaments at least three times each, a unique achievement."
    },
    {
      "id": "sport_9",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilket brädspel går ut på att placera ord horisontellt och vertikalt med hjälp av bokstavsbrickor?",
      "textEn": "Which board game involves placing words horizontally and vertically using letter tiles?",
      "optionsSv": ["Scrabble", "Monopol", "Schack", "Risk"],
      "optionsEn": ["Scrabble", "Monopoly", "Chess", "Risk"],
      "correctIndex": 0,
      "funFactSv": "Scrabble uppfanns på 1930‑talet och säljs idag på över 30 språk.",
      "funFactEn": "Scrabble was invented in the 1930s and is now sold in more than 30 languages."
    },
    {
      "id": "sport_10",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken schackspelare var den första att vinna världsmästerskapet i schack efter att ha besegrat Garry Kasparov?",
      "textEn": "Which chess player was the first to win the World Chess Championship after defeating Garry Kasparov?",
      "optionsSv": ["Vladimir Kramnik", "Viswanathan Anand", "Veselin Topalov", "Rustam Kasimdzhanov"],
      "optionsEn": ["Vladimir Kramnik", "Viswanathan Anand", "Veselin Topalov", "Rustam Kasimdzhanov"],
      "correctIndex": 0,
      "funFactSv": "Kramnik besegrade Kasparov 2000 och blev den första klassiska världsmästaren efter splittringen.",
      "funFactEn": "Kramnik defeated Kasparov in 2000 and became the first classical world champion after the split."
    },
    {
      "id": "sport_11",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilket land har vunnit flest OS-medaljer totalt i olympiska sommarspelens historia?",
      "textEn": "Which country has won the most total medals in Summer Olympic Games history?",
      "optionsSv": ["USA", "Sovjetunionen", "Storbritannien", "Tyskland"],
      "optionsEn": ["United States", "Soviet Union", "Great Britain", "Germany"],
      "correctIndex": 0,
      "funFactSv": "USA har vunnit över 2 500 medaljer i sommar-OS, mer än dubbelt så många som näst bästa land.",
      "funFactEn": "The US has won over 2,500 medals in Summer Olympics, more than double the next best country."
    },
    {
      "id": "sport_12",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken schackspelare var den första att vinna världsmästerskapet i schack som rysk spelare efter Sovjetunionens fall?",
      "textEn": "Which chess player was the first to win the World Chess Championship as a Russian player after the fall of the Soviet Union?",
      "optionsSv": ["Vladimir Kramnik", "Garry Kasparov", "Anatoly Karpov", "Alexander Khalifman"],
      "optionsEn": ["Vladimir Kramnik", "Garry Kasparov", "Anatoly Karpov", "Alexander Khalifman"],
      "correctIndex": 0,
      "funFactSv": "Kramnik var världsmästare från 2000 till 2007 och är känd för sin positionella stil.",
      "funFactEn": "Kramnik was world champion from 2000 to 2007 and is known for his positional style."
    },
    {
      "id": "sport_13",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken schackspelare var den första att vinna världsmästerskapet i schack som indier?",
      "textEn": "Which chess player was the first to win the World Chess Championship as an Indian?",
      "optionsSv": ["Viswanathan Anand", "Pentala Harikrishna", "Krishnan Sasikiran", "Abhijeet Gupta"],
      "optionsEn": ["Viswanathan Anand", "Pentala Harikrishna", "Krishnan Sasikiran", "Abhijeet Gupta"],
      "correctIndex": 0,
      "funFactSv": "Anand var världsmästare från 2007 till 2013 och är känd för sin snabba spelstil.",
      "funFactEn": "Anand was world champion from 2007 to 2013 and is known for his fast playing style."
    },
    {
      "id": "sport_14",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken schackspelare var den första att vinna världsmästerskapet i schack som kines?",
      "textEn": "Which chess player was the first to win the World Chess Championship as a Chinese?",
      "optionsSv": ["Ding Liren", "Wang Hao", "Yu Yangyi", "Wei Yi"],
      "optionsEn": ["Ding Liren", "Wang Hao", "Yu Yangyi", "Wei Yi"],
      "correctIndex": 0,
      "funFactSv": "Ding Liren blev världsmästare 2023 och var den första kinesen att vinna titeln.",
      "funFactEn": "Ding Liren became world champion in 2023 and was the first Chinese to win the title."
    },
    {
      "id": "sport_15",
      "category": "sportMisc",
      "difficulty": "hard",
      "textSv": "Vilken schackspelare var den första att vinna världsmästerskapet i schack som norrman?",
      "textEn": "Which chess player was the first to win the World Chess Championship as a Norwegian?",
      "optionsSv": ["Magnus Carlsen", "Simen Agdestein", "Jon Ludvig Hammer", "Aryan Tari"],
      "optionsEn": ["Magnus Carlsen", "Simen Agdestein", "Jon Ludvig Hammer", "Aryan Tari"],
      "correctIndex": 0,
      "funFactSv": "Carlsen blev världsmästare 2013 och har dominerat schackvärlden i över ett decennium.",
      "funFactEn": "Carlsen became world champion in 2013 and has dominated the chess world for over a decade."
    },
    {
      "id": "scitech_1",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker formulerade den s.k. oändlighetsparadoxen och visade att det finns olika storlekar av oändlighet?",
      "textEn": "Which mathematician formulated the infinity paradox and showed that there are different sizes of infinity?",
      "optionsSv": ["Georg Cantor", "Kurt Gödel", "David Hilbert", "Bertrand Russell"],
      "optionsEn": ["Georg Cantor", "Kurt Gödel", "David Hilbert", "Bertrand Russell"],
      "correctIndex": 0,
      "funFactSv": "Cantors mängdlära revolutionerade matematiken och visade att det finns oändligheter större än andra.",
      "funFactEn": "Cantor's set theory revolutionized mathematics and showed that some infinities are larger than others."
    },
    {
      "id": "scitech_2",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken fysiker formulerade osäkerhetsprincipen som säger att man inte kan känna till både en partikels position och rörelsemängd exakt samtidigt?",
      "textEn": "Which physicist formulated the uncertainty principle stating that you cannot know both a particle's position and momentum exactly at the same time?",
      "optionsSv": ["Werner Heisenberg", "Niels Bohr", "Erwin Schrödinger", "Max Planck"],
      "optionsEn": ["Werner Heisenberg", "Niels Bohr", "Erwin Schrödinger", "Max Planck"],
      "correctIndex": 0,
      "funFactSv": "Heisenbergs osäkerhetsprincip är en grundläggande del av kvantmekaniken och visar gränserna för vad vi kan veta.",
      "funFactEn": "Heisenberg's uncertainty principle is a fundamental part of quantum mechanics and shows the limits of what we can know."
    },
    {
      "id": "scitech_3",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken upptäckt gjorde Rosalind Franklin som var avgörande för att förstå DNA:s struktur?",
      "textEn": "What discovery did Rosalind Franklin make that was crucial for understanding DNA's structure?",
      "optionsSv": ["Röntgenkristallografi av DNA", "DNA-sekvensering", "PCR-teknik", "Genmanipulation"],
      "optionsEn": ["X-ray crystallography of DNA", "DNA sequencing", "PCR technique", "Genetic engineering"],
      "correctIndex": 0,
      "funFactSv": "Franklins röntgenbilder visade DNA:s helixstruktur, men hon fick inte Nobelpriset eftersom hon dog 1958.",
      "funFactEn": "Franklin's X-ray images revealed DNA's helix structure, but she didn't receive the Nobel Prize as she died in 1958."
    },
    {
      "id": "scitech_4",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom ett bevis som använder motsägelse?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers through a proof using contradiction?",
      "optionsSv": ["Euklides", "Eratosthenes", "Archimedes", "Pythagoras"],
      "optionsEn": ["Euclid", "Eratosthenes", "Archimedes", "Pythagoras"],
      "correctIndex": 0,
      "funFactSv": "Euklides bevis från 300-talet f.Kr. är ett av matematikens mest eleganta bevis och används fortfarande idag.",
      "funFactEn": "Euclid's proof from the 3rd century BC is one of mathematics' most elegant proofs and is still used today."
    },
    {
      "id": "scitech_5",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker formulerade Fermats sista sats, som inte bevisades förrän 1994 av Andrew Wiles?",
      "textEn": "Which mathematician formulated Fermat's Last Theorem, which was not proven until 1994 by Andrew Wiles?",
      "optionsSv": ["Pierre de Fermat", "Leonhard Euler", "Carl Friedrich Gauss", "Henri Poincaré"],
      "optionsEn": ["Pierre de Fermat", "Leonhard Euler", "Carl Friedrich Gauss", "Henri Poincaré"],
      "correctIndex": 0,
      "funFactSv": "Fermat skrev att han hade ett bevis men att marginalen var för liten, och problemet förblev olöst i över 350 år.",
      "funFactEn": "Fermat wrote that he had a proof but the margin was too small, and the problem remained unsolved for over 350 years."
    },
    {
      "id": "scitech_6",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtalstvillingar genom att visa att summan av deras reciproker divergerar?",
      "textEn": "Which mathematician proved that there are infinitely many twin primes by showing that the sum of their reciprocals diverges?",
      "optionsSv": ["Viggo Brun", "Paul Erdős", "Terence Tao", "Yitang Zhang"],
      "optionsEn": ["Viggo Brun", "Paul Erdős", "Terence Tao", "Yitang Zhang"],
      "correctIndex": 0,
      "funFactSv": "Brun visade 1919 att summan av reciproker av primtalstvillingar konvergerar, vilket är ett viktigt steg mot primtalstvillinghypotesen.",
      "funFactEn": "Brun showed in 1919 that the sum of reciprocals of twin primes converges, which is an important step toward the twin prime hypothesis."
    },
    {
      "id": "scitech_7",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken fysiker formulerade Schrödinger-ekvationen som beskriver hur kvantmekaniska system utvecklas över tid?",
      "textEn": "Which physicist formulated the Schrödinger equation that describes how quantum mechanical systems evolve over time?",
      "optionsSv": ["Erwin Schrödinger", "Werner Heisenberg", "Niels Bohr", "Max Planck"],
      "optionsEn": ["Erwin Schrödinger", "Werner Heisenberg", "Niels Bohr", "Max Planck"],
      "correctIndex": 0,
      "funFactSv": "Schrödinger-ekvationen är fundamental för kvantmekaniken och beskriver sannolikhetsamplituder för kvanttillstånd.",
      "funFactEn": "The Schrödinger equation is fundamental to quantum mechanics and describes probability amplitudes for quantum states."
    },
    {
      "id": "scitech_8",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda Riemanns zetafunktion?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using the Riemann zeta function?",
      "optionsSv": ["Leonhard Euler", "Bernhard Riemann", "Carl Friedrich Gauss", "Pierre de Fermat"],
      "optionsEn": ["Leonhard Euler", "Bernhard Riemann", "Carl Friedrich Gauss", "Pierre de Fermat"],
      "correctIndex": 0,
      "funFactSv": "Euler visade att summan av 1/p över alla primtal p divergerar, vilket bevisar att det finns oändligt många primtal.",
      "funFactEn": "Euler showed that the sum of 1/p over all primes p diverges, which proves that there are infinitely many primes."
    },
    {
      "id": "scitech_9",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker formulerade Riemannhypotesen, ett av matematikens sju millenniumproblem?",
      "textEn": "Which mathematician formulated the Riemann Hypothesis, one of mathematics' seven Millennium Problems?",
      "optionsSv": ["Bernhard Riemann", "Leonhard Euler", "Carl Friedrich Gauss", "Henri Poincaré"],
      "optionsEn": ["Bernhard Riemann", "Leonhard Euler", "Carl Friedrich Gauss", "Henri Poincaré"],
      "correctIndex": 0,
      "funFactSv": "Riemannhypotesen handlar om nollställena till Riemanns zetafunktion och är fortfarande obevisad trots 160 års forskning.",
      "funFactEn": "The Riemann Hypothesis concerns the zeros of the Riemann zeta function and remains unproven despite 160 years of research."
    },
    {
      "id": "scitech_10",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda analytisk talteori?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using analytic number theory?",
      "optionsSv": ["Leonhard Euler", "Bernhard Riemann", "Carl Friedrich Gauss", "Pierre de Fermat"],
      "optionsEn": ["Leonhard Euler", "Bernhard Riemann", "Carl Friedrich Gauss", "Pierre de Fermat"],
      "correctIndex": 0,
      "funFactSv": "Euler använde zetafunktionen för att visa att det finns oändligt många primtal, ett viktigt steg i analytisk talteori.",
      "funFactEn": "Euler used the zeta function to show that there are infinitely many primes, an important step in analytic number theory."
    },
    {
      "id": "scitech_11",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda primtalssatsen?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using the prime number theorem?",
      "optionsSv": ["Jacques Hadamard", "Charles de la Vallée Poussin", "Bernhard Riemann", "Carl Friedrich Gauss"],
      "optionsEn": ["Jacques Hadamard", "Charles de la Vallée Poussin", "Bernhard Riemann", "Carl Friedrich Gauss"],
      "correctIndex": 0,
      "funFactSv": "Hadamard och de la Vallée Poussin bevisade primtalssatsen oberoende 1896, vilket visar att det finns oändligt många primtal.",
      "funFactEn": "Hadamard and de la Vallée Poussin proved the prime number theorem independently in 1896, showing that there are infinitely many primes."
    },
    {
      "id": "scitech_12",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda Dirichlets sats om aritmetiska följder?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using Dirichlet's theorem on arithmetic progressions?",
      "optionsSv": ["Peter Gustav Lejeune Dirichlet", "Carl Friedrich Gauss", "Leonhard Euler", "Bernhard Riemann"],
      "optionsEn": ["Peter Gustav Lejeune Dirichlet", "Carl Friedrich Gauss", "Leonhard Euler", "Bernhard Riemann"],
      "correctIndex": 0,
      "funFactSv": "Dirichlets sats visar att det finns oändligt många primtal i varje aritmetisk följd där första termen och skillnaden är relativt prima.",
      "funFactEn": "Dirichlet's theorem shows that there are infinitely many primes in every arithmetic progression where the first term and difference are coprime."
    },
    {
      "id": "scitech_13",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda Green-Tao-satsen?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using the Green-Tao theorem?",
      "optionsSv": ["Ben Green och Terence Tao", "Andrew Wiles", "Grigori Perelman", "Yitang Zhang"],
      "optionsEn": ["Ben Green and Terence Tao", "Andrew Wiles", "Grigori Perelman", "Yitang Zhang"],
      "correctIndex": 0,
      "funFactSv": "Green-Tao-satsen visar att det finns oändligt långa aritmetiska följder av primtal, ett viktigt resultat i talteori.",
      "funFactEn": "The Green-Tao theorem shows that there are arbitrarily long arithmetic progressions of primes, an important result in number theory."
    },
    {
      "id": "scitech_14",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda Zhangs sats om primtalstvillingar?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using Zhang's theorem on twin primes?",
      "optionsSv": ["Yitang Zhang", "Terence Tao", "Andrew Wiles", "Grigori Perelman"],
      "optionsEn": ["Yitang Zhang", "Terence Tao", "Andrew Wiles", "Grigori Perelman"],
      "correctIndex": 0,
      "funFactSv": "Zhang visade 2013 att det finns oändligt många primtalspar med gap mindre än 70 miljoner, ett viktigt steg mot primtalstvillinghypotesen.",
      "funFactEn": "Zhang showed in 2013 that there are infinitely many prime pairs with gaps less than 70 million, an important step toward the twin prime hypothesis."
    },
    {
      "id": "scitech_15",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda Euklides bevis?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using Euclid's proof?",
      "optionsSv": ["Euklides", "Eratosthenes", "Archimedes", "Pythagoras"],
      "optionsEn": ["Euclid", "Eratosthenes", "Archimedes", "Pythagoras"],
      "correctIndex": 0,
      "funFactSv": "Euklides bevis från 300-talet f.Kr. är ett av matematikens mest eleganta bevis och används fortfarande idag.",
      "funFactEn": "Euclid's proof from the 3rd century BC is one of mathematics' most elegant proofs and is still used today."
    },
    {
      "id": "scitech_16",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken fysiker formulerade relativitetsteorin och visade att tid och rum är relativt?",
      "textEn": "Which physicist formulated the theory of relativity and showed that time and space are relative?",
      "optionsSv": ["Albert Einstein", "Isaac Newton", "Niels Bohr", "Max Planck"],
      "optionsEn": ["Albert Einstein", "Isaac Newton", "Niels Bohr", "Max Planck"],
      "correctIndex": 0,
      "funFactSv": "Einsteins relativitetsteori revolutionerade fysiken och visade att tid och rum är sammanflätade i rumtiden.",
      "funFactEn": "Einstein's theory of relativity revolutionized physics and showed that time and space are intertwined in spacetime."
    },
    {
      "id": "scitech_17",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda Eulers produktformel för zetafunktionen?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using Euler's product formula for the zeta function?",
      "optionsSv": ["Leonhard Euler", "Bernhard Riemann", "Carl Friedrich Gauss", "Pierre de Fermat"],
      "optionsEn": ["Leonhard Euler", "Bernhard Riemann", "Carl Friedrich Gauss", "Pierre de Fermat"],
      "correctIndex": 0,
      "funFactSv": "Eulers produktformel visar att zetafunktionen kan skrivas som en produkt över alla primtal, vilket bevisar att det finns oändligt många primtal.",
      "funFactEn": "Euler's product formula shows that the zeta function can be written as a product over all primes, which proves that there are infinitely many primes."
    },
    {
      "id": "scitech_18",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda analytisk fortsättning av zetafunktionen?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using analytic continuation of the zeta function?",
      "optionsSv": ["Bernhard Riemann", "Leonhard Euler", "Carl Friedrich Gauss", "Pierre de Fermat"],
      "optionsEn": ["Bernhard Riemann", "Leonhard Euler", "Carl Friedrich Gauss", "Pierre de Fermat"],
      "correctIndex": 0,
      "funFactSv": "Riemann utökade zetafunktionen till hela det komplexa planet och visade dess koppling till primtal.",
      "funFactEn": "Riemann extended the zeta function to the entire complex plane and showed its connection to primes."
    },
    {
      "id": "scitech_19",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda primtalssatsen och analytisk talteori?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using the prime number theorem and analytic number theory?",
      "optionsSv": ["Jacques Hadamard", "Charles de la Vallée Poussin", "Bernhard Riemann", "Carl Friedrich Gauss"],
      "optionsEn": ["Jacques Hadamard", "Charles de la Vallée Poussin", "Bernhard Riemann", "Carl Friedrich Gauss"],
      "correctIndex": 0,
      "funFactSv": "Hadamard och de la Vallée Poussin bevisade primtalssatsen oberoende 1896 med hjälp av analytisk talteori.",
      "funFactEn": "Hadamard and de la Vallée Poussin proved the prime number theorem independently in 1896 using analytic number theory."
    },
    {
      "id": "scitech_20",
      "category": "scienceTech",
      "difficulty": "hard",
      "textSv": "Vilken matematiker bevisade att det finns oändligt många primtal genom att använda Dirichlets L-funktioner?",
      "textEn": "Which mathematician proved that there are infinitely many prime numbers by using Dirichlet's L-functions?",
      "optionsSv": ["Peter Gustav Lejeune Dirichlet", "Carl Friedrich Gauss", "Leonhard Euler", "Bernhard Riemann"],
      "optionsEn": ["Peter Gustav Lejeune Dirichlet", "Carl Friedrich Gauss", "Leonhard Euler", "Bernhard Riemann"],
      "correctIndex": 0,
      "funFactSv": "Dirichlet använde L-funktioner för att bevisa att det finns oändligt många primtal i aritmetiska följder.",
      "funFactEn": "Dirichlet used L-functions to prove that there are infinitely many primes in arithmetic progressions."
    }
  ]
  