[
  {
    "id": "nowthen_1",
    "category": "nowThen",
    "difficulty": "medium",
    "textSv": "Vilken svensk kung abdikerade 1654 för att konvertera till katolicismen och flytta till Rom?",
    "textEn": "Which Swedish king abdicated in 1654 to convert to Catholicism and move to Rome?",
    "optionsSv": ["Kristina", "Gustav II Adolf", "Karl XII", "Gustav III"],
    "optionsEn": ["Christina", "Gustavus Adolphus", "Charles XII", "Gustav III"],
    "correctIndex": 0,
    "funFactSv": "Drottning Kristina var en av de mest bildade monarkerna i sin tid och samlade konst och böcker.",
    "funFactEn": "Queen Christina was one of the most educated monarchs of her time and collected art and books."
  },
  {
    "id": "nowthen_2",
    "category": "nowThen",
    "difficulty": "hard",
    "textSv": "Vilken fredsöverenskommelse 1648 avslutade trettioåriga kriget och lade grunden för den moderna statsordningen i Europa?",
    "textEn": "Which 1648 peace settlement ended the Thirty Years' War and helped establish the modern state system in Europe?",
    "optionsSv": ["Westfaliska freden", "Versaillesfreden", "Utrechtfreden", "Wienkongressen"],
    "optionsEn": ["The Peace of Westphalia", "The Treaty of Versailles", "The Treaty of Utrecht", "The Congress of Vienna"],
    "correctIndex": 0,
    "funFactSv": "Westfaliska freden ses ofta som startpunkten för principen om suveräna nationalstater.",
    "funFactEn": "The Peace of Westphalia is often seen as the starting point for the principle of sovereign nation-states."
  },
  {
    "id": "nowthen_3",
    "category": "nowThen",
    "difficulty": "hard",
    "textSv": "Vilken bysantinsk kejsare återerövrade stora delar av det västra romerska riket under 500-talet?",
    "textEn": "Which Byzantine emperor reconquered large parts of the Western Roman Empire in the 6th century?",
    "optionsSv": ["Justinianus I", "Konstantin den store", "Theodosius I", "Heraclius"],
    "optionsEn": ["Justinian I", "Constantine the Great", "Theodosius I", "Heraclius"],
    "correctIndex": 0,
    "funFactSv": "Justinianus kodifierade romersk lag i Corpus Juris Civilis, som påverkat rättssystem världen över.",
    "funFactEn": "Justinian codified Roman law in the Corpus Juris Civilis, which has influenced legal systems worldwide."
  },
  {
    "id": "nowthen_4",
    "category": "nowThen",
    "difficulty": "medium",
    "textSv": "Vilket år avskaffades slaveriet i USA genom det 13:e tillägget till konstitutionen?",
    "textEn": "In which year was slavery abolished in the US through the 13th Amendment to the Constitution?",
    "optionsSv": ["1865", "1861", "1863", "1870"],
    "optionsEn": ["1865", "1861", "1863", "1870"],
    "correctIndex": 0,
    "funFactSv": "Det 13:e tillägget ratificerades efter inbördeskrigets slut och avskaffade slaveriet i hela USA.",
    "funFactEn": "The 13th Amendment was ratified after the Civil War ended and abolished slavery throughout the US."
  },
  {
    "id": "nowthen_5",
    "category": "nowThen",
    "difficulty": "hard",
    "textSv": "Vilken revolutionär ledde det kubanska upproret mot Batista-regimen och blev senare landets ledare?",
    "textEn": "Which revolutionary led the Cuban uprising against the Batista regime and later became the country's leader?",
    "optionsSv": ["Fidel Castro", "Che Guevara", "Salvador Allende", "Augusto Pinochet"],
    "optionsEn": ["Fidel Castro", "Che Guevara", "Salvador Allende", "Augusto Pinochet"],
    "correctIndex": 0,
    "funFactSv": "Castro styrde Kuba i nästan 50 år, från 1959 till 2008, vilket gör honom till en av världens längst regerande ledare.",
    "funFactEn": "Castro ruled Cuba for almost 50 years, from 1959 to 2008, making him one of the world's longest-serving leaders."
  },
  {
    "id": "ent_1",
    "category": "entertainment",
    "difficulty": "medium",
    "textSv": "Vilken svensk regissör skapade filmerna \"Persona\" och \"Det sjunde inseglet\"?",
    "textEn": "Which Swedish director created the films \"Persona\" and \"The Seventh Seal\"?",
    "optionsSv": ["Ingmar Bergman", "Lukas Moodysson", "Ruben Östlund", "Roy Andersson"],
    "optionsEn": ["Ingmar Bergman", "Lukas Moodysson", "Ruben Östlund", "Roy Andersson"],
    "correctIndex": 0,
    "funFactSv": "Bergman regisserade över 60 filmer och teaterpjäser och anses vara en av filmhistoriens största regissörer.",
    "funFactEn": "Bergman directed over 60 films and plays and is considered one of cinema's greatest directors."
  },
  {
    "id": "ent_2",
    "category": "entertainment",
    "difficulty": "hard",
    "textSv": "Vilken rysk författare skrev \"Brott och straff\" och \"Idioten\"?",
    "textEn": "Which Russian author wrote \"Crime and Punishment\" and \"The Idiot\"?",
    "optionsSv": ["Fjodor Dostojevskij", "Leo Tolstoj", "Anton Tjechov", "Ivan Turgenjev"],
    "optionsEn": ["Fyodor Dostoevsky", "Leo Tolstoy", "Anton Chekhov", "Ivan Turgenev"],
    "correctIndex": 0,
    "funFactSv": "Dostojevskij dömdes till döden 1849 men benådades i sista stund och skickades i stället till Sibirien.",
    "funFactEn": "Dostoevsky was sentenced to death in 1849 but was pardoned at the last moment and sent to Siberia instead."
  },
  {
    "id": "ent_3",
    "category": "entertainment",
    "difficulty": "hard",
    "textSv": "Vilken kompositör skrev operan \"Tristan och Isolde\" och revolutionerade harmoniken i västerländsk musik?",
    "textEn": "Which composer wrote the opera \"Tristan und Isolde\" and revolutionized harmony in Western music?",
    "optionsSv": ["Richard Wagner", "Giuseppe Verdi", "Giacomo Puccini", "Richard Strauss"],
    "optionsEn": ["Richard Wagner", "Giuseppe Verdi", "Giacomo Puccini", "Richard Strauss"],
    "correctIndex": 0,
    "funFactSv": "Wagners användning av oupplösta dissonanser i Tristan förberedde vägen för atonal musik.",
    "funFactEn": "Wagner's use of unresolved dissonances in Tristan paved the way for atonal music."
  },
  {
    "id": "ent_4",
    "category": "entertainment",
    "difficulty": "medium",
    "textSv": "Vilken amerikansk författare skrev \"The Great Gatsby\" och \"Tender Is the Night\"?",
    "textEn": "Which American author wrote \"The Great Gatsby\" and \"Tender Is the Night\"?",
    "optionsSv": ["F. Scott Fitzgerald", "Ernest Hemingway", "William Faulkner", "John Steinbeck"],
    "optionsEn": ["F. Scott Fitzgerald", "Ernest Hemingway", "William Faulkner", "John Steinbeck"],
    "correctIndex": 0,
    "funFactSv": "Fitzgerald var en centralfigur i den så kallade \"förlorade generationen\" och skildrade 1920-talets Amerika.",
    "funFactEn": "Fitzgerald was a central figure of the \"Lost Generation\" and depicted 1920s America."
  },
  {
    "id": "ent_5",
    "category": "entertainment",
    "difficulty": "hard",
    "textSv": "Vilken tysk filosof skrev \"Tragedins födelse\" och kritiserade västerländsk rationalism?",
    "textEn": "Which German philosopher wrote \"The Birth of Tragedy\" and criticized Western rationalism?",
    "optionsSv": ["Friedrich Nietzsche", "Immanuel Kant", "Georg Hegel", "Arthur Schopenhauer"],
    "optionsEn": ["Friedrich Nietzsche", "Immanuel Kant", "Georg Hegel", "Arthur Schopenhauer"],
    "correctIndex": 0,
    "funFactSv": "Nietzsches idéer om övermänniskan och eviga återkomsten har haft enorm påverkan på filosofi och kultur.",
    "funFactEn": "Nietzsche's ideas about the Übermensch and eternal recurrence have had enormous influence on philosophy and culture."
  },
  {
    "id": "nearf_1",
    "category": "nearFar",
    "difficulty": "medium",
    "textSv": "Vilket land i Centralasien var en del av Sovjetunionen och har Astana (numera Nur-Sultan) som huvudstad?",
    "textEn": "Which Central Asian country was part of the Soviet Union and has Astana (now Nur-Sultan) as its capital?",
    "optionsSv": ["Kazakstan", "Uzbekistan", "Turkmenistan", "Kirgizistan"],
    "optionsEn": ["Kazakhstan", "Uzbekistan", "Turkmenistan", "Kyrgyzstan"],
    "correctIndex": 0,
    "funFactSv": "Kazakstan är världens nionde största land till ytan men har bara omkring 19 miljoner invånare.",
    "funFactEn": "Kazakhstan is the world's ninth-largest country by area but has only about 19 million inhabitants."
  },
  {
    "id": "nearf_2",
    "category": "nearFar",
    "difficulty": "hard",
    "textSv": "Vilken stad i Marocko är känd för sin blå färgade medina och är en UNESCO-världsarvsplats?",
    "textEn": "Which city in Morocco is famous for its blue-painted medina and is a UNESCO World Heritage site?",
    "optionsSv": ["Chefchaouen", "Marrakech", "Fes", "Casablanca"],
    "optionsEn": ["Chefchaouen", "Marrakech", "Fes", "Casablanca"],
    "correctIndex": 0,
    "funFactSv": "Chefchaouens blå färg sägs ha introducerats av judiska flyktingar på 1930-talet som symboliserar himlen och gud.",
    "funFactEn": "Chefchaouen's blue color is said to have been introduced by Jewish refugees in the 1930s, symbolizing heaven and God."
  },
  {
    "id": "nearf_3",
    "category": "nearFar",
    "difficulty": "hard",
    "textSv": "Vilket land i Sydostasien består av över 7 000 öar och har Manila som huvudstad?",
    "textEn": "Which Southeast Asian country consists of over 7,000 islands and has Manila as its capital?",
    "optionsSv": ["Filippinerna", "Indonesien", "Malaysia", "Thailand"],
    "optionsEn": ["Philippines", "Indonesia", "Malaysia", "Thailand"],
    "correctIndex": 0,
    "funFactSv": "Filippinerna är världens femte största ö-nation och har över 100 miljoner invånare.",
    "funFactEn": "The Philippines is the world's fifth-largest archipelagic nation with over 100 million inhabitants."
  },
  {
    "id": "nearf_4",
    "category": "nearFar",
    "difficulty": "medium",
    "textSv": "Vilken flod i Sydamerika är världens längsta och rinner genom Brasilien, Peru och Colombia?",
    "textEn": "Which South American river is the world's longest and flows through Brazil, Peru, and Colombia?",
    "optionsSv": ["Amazonas", "Nilen", "Mississippi", "Yangtze"],
    "optionsEn": ["Amazon", "Nile", "Mississippi", "Yangtze"],
    "correctIndex": 0,
    "funFactSv": "Amazonasfloden har större vattenflöde än de näst sju största floderna tillsammans.",
    "funFactEn": "The Amazon River has a greater water flow than the next seven largest rivers combined."
  },
  {
    "id": "nearf_5",
    "category": "nearFar",
    "difficulty": "hard",
    "textSv": "Vilket land i Västafrika var tidigare känt som Dahomey och är känt för sina amazonsoldater?",
    "textEn": "Which West African country was formerly known as Dahomey and is famous for its Amazon warriors?",
    "optionsSv": ["Benin", "Togo", "Ghana", "Nigeria"],
    "optionsEn": ["Benin", "Togo", "Ghana", "Nigeria"],
    "correctIndex": 0,
    "funFactSv": "Kungariket Dahomey hade en elitkår av kvinnliga soldater som var fruktade i hela regionen.",
    "funFactEn": "The Kingdom of Dahomey had an elite corps of female soldiers who were feared throughout the region."
  },
  {
    "id": "sport_1",
    "category": "sportMisc",
    "difficulty": "medium",
    "textSv": "Vilket land har vunnit flest OS-medaljer totalt i olympiska sommarspelens historia?",
    "textEn": "Which country has won the most total medals in Summer Olympic Games history?",
    "optionsSv": ["USA", "Sovjetunionen", "Storbritannien", "Tyskland"],
    "optionsEn": ["United States", "Soviet Union", "Great Britain", "Germany"],
    "correctIndex": 0,
    "funFactSv": "USA har vunnit över 2 500 medaljer i sommar-OS, mer än dubbelt så många som näst bästa land.",
    "funFactEn": "The US has won over 2,500 medals in Summer Olympics, more than double the next best country."
  },
  {
    "id": "sport_2",
    "category": "sportMisc",
    "difficulty": "hard",
    "textSv": "Vilken tennisspelare har vunnit flest Grand Slam-titlar i singel (män)?",
    "textEn": "Which tennis player has won the most Grand Slam singles titles (men)?",
    "optionsSv": ["Novak Djokovic", "Roger Federer", "Rafael Nadal", "Pete Sampras"],
    "optionsEn": ["Novak Djokovic", "Roger Federer", "Rafael Nadal", "Pete Sampras"],
    "correctIndex": 0,
    "funFactSv": "Djokovic har vunnit alla fyra Grand Slam-turneringar minst tre gånger vardera, en unik bedrift.",
    "funFactEn": "Djokovic has won all four Grand Slam tournaments at least three times each, a unique achievement."
  },
  {
    "id": "sport_3",
    "category": "sportMisc",
    "difficulty": "hard",
    "textSv": "Vilket år arrangerades de första paralympiska spelen i Rom?",
    "textEn": "In which year were the first Paralympic Games held in Rome?",
    "optionsSv": ["1960", "1948", "1952", "1964"],
    "optionsEn": ["1960", "1948", "1952", "1964"],
    "correctIndex": 0,
    "funFactSv": "Paralympiska spelen växte fram ur Stoke Mandeville Games, som startades för krigsveteraner 1948.",
    "funFactEn": "The Paralympic Games grew out of the Stoke Mandeville Games, started for war veterans in 1948."
  },
  {
    "id": "sport_4",
    "category": "sportMisc",
    "difficulty": "medium",
    "textSv": "Vilket brädspel går ut på att placera ord horisontellt och vertikalt med hjälp av bokstavsbrickor?",
    "textEn": "Which board game involves placing words horizontally and vertically using letter tiles?",
    "optionsSv": ["Scrabble", "Monopol", "Schack", "Risk"],
    "optionsEn": ["Scrabble", "Monopoly", "Chess", "Risk"],
    "correctIndex": 0,
    "funFactSv": "Scrabble uppfanns på 1930‑talet och säljs idag på över 30 språk.",
    "funFactEn": "Scrabble was invented in the 1930s and is now sold in more than 30 languages."
  },
  {
    "id": "sport_5",
    "category": "sportMisc",
    "difficulty": "hard",
    "textSv": "Vilken svensk orienterare har vunnit flest individuella VM-guld i orientering?",
    "textEn": "Which Swedish orienteer has won the most individual World Championship gold medals in orienteering?",
    "optionsSv": ["Thierry Gueorgiou", "Simone Niggli", "Daniel Hubmann", "Tove Alexandersson"],
    "optionsEn": ["Thierry Gueorgiou", "Simone Niggli", "Daniel Hubmann", "Tove Alexandersson"],
    "correctIndex": 0,
    "funFactSv": "Gueorgiou, som tävlade för Frankrike men är född i Sverige, dominerade orienteringsvärlden på 2000-talet.",
    "funFactEn": "Gueorgiou, who competed for France but was born in Sweden, dominated the orienteering world in the 2000s."
  },
  {
    "id": "scitech_1",
    "category": "scienceTech",
    "difficulty": "medium",
    "textSv": "Vilket grundämne har atomnumret 6 och är grunden för allt organiskt liv?",
    "textEn": "Which chemical element has atomic number 6 and is the basis for all organic life?",
    "optionsSv": ["Kol", "Kväve", "Syre", "Väte"],
    "optionsEn": ["Carbon", "Nitrogen", "Oxygen", "Hydrogen"],
    "correctIndex": 0,
    "funFactSv": "Kol kan bilda miljontals olika föreningar på grund av sin förmåga att bilda långa kedjor och ringar.",
    "funFactEn": "Carbon can form millions of different compounds due to its ability to form long chains and rings."
  },
  {
    "id": "scitech_2",
    "category": "scienceTech",
    "difficulty": "hard",
    "textSv": "Vilken matematiker formulerade den s.k. oändlighetsparadoxen och visade att det finns olika storlekar av oändlighet?",
    "textEn": "Which mathematician formulated the infinity paradox and showed that there are different sizes of infinity?",
    "optionsSv": ["Georg Cantor", "Kurt Gödel", "David Hilbert", "Bertrand Russell"],
    "optionsEn": ["Georg Cantor", "Kurt Gödel", "David Hilbert", "Bertrand Russell"],
    "correctIndex": 0,
    "funFactSv": "Cantors mängdlära revolutionerade matematiken och visade att det finns oändligheter större än andra.",
    "funFactEn": "Cantor's set theory revolutionized mathematics and showed that some infinities are larger than others."
  },
  {
    "id": "scitech_3",
    "category": "scienceTech",
    "difficulty": "hard",
    "textSv": "Vilken upptäckt gjorde Rosalind Franklin som var avgörande för att förstå DNA:s struktur?",
    "textEn": "What discovery did Rosalind Franklin make that was crucial for understanding DNA's structure?",
    "optionsSv": ["Röntgenkristallografi av DNA", "DNA-sekvensering", "PCR-teknik", "Genmanipulation"],
    "optionsEn": ["X-ray crystallography of DNA", "DNA sequencing", "PCR technique", "Genetic engineering"],
    "correctIndex": 0,
    "funFactSv": "Franklins röntgenbilder visade DNA:s helixstruktur, men hon fick inte Nobelpriset eftersom hon dog 1958.",
    "funFactEn": "Franklin's X-ray images revealed DNA's helix structure, but she didn't receive the Nobel Prize as she died in 1958."
  },
  {
    "id": "scitech_4",
    "category": "scienceTech",
    "difficulty": "medium",
    "textSv": "Vilket år lanserades World Wide Web av Tim Berners-Lee?",
    "textEn": "In which year was the World Wide Web launched by Tim Berners-Lee?",
    "optionsSv": ["1991", "1989", "1993", "1995"],
    "optionsEn": ["1991", "1989", "1993", "1995"],
    "correctIndex": 0,
    "funFactSv": "Berners-Lee skapade både HTML, HTTP och den första webbläsaren medan han arbetade vid CERN.",
    "funFactEn": "Berners-Lee created HTML, HTTP, and the first web browser while working at CERN."
  },
  {
    "id": "scitech_5",
    "category": "scienceTech",
    "difficulty": "hard",
    "textSv": "Vilken fysiker formulerade osäkerhetsprincipen som säger att man inte kan känna till både en partikels position och rörelsemängd exakt samtidigt?",
    "textEn": "Which physicist formulated the uncertainty principle stating that you cannot know both a particle's position and momentum exactly at the same time?",
    "optionsSv": ["Werner Heisenberg", "Niels Bohr", "Erwin Schrödinger", "Max Planck"],
    "optionsEn": ["Werner Heisenberg", "Niels Bohr", "Erwin Schrödinger", "Max Planck"],
    "correctIndex": 0,
    "funFactSv": "Heisenbergs osäkerhetsprincip är en grundläggande del av kvantmekaniken och visar gränserna för vad vi kan veta.",
    "funFactEn": "Heisenberg's uncertainty principle is a fundamental part of quantum mechanics and shows the limits of what we can know."
  }
]
